
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5098446706)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ac5af99053517d53]
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063b5de1a8e57c2f0]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-09bbe5d247799c91a]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:972365086582:cluster/go-simple-server]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/go-simple-server]
aws_iam_role.ecs: Refreshing state... [id=go-simple-server-ecs]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
aws_iam_role.ecs_task: Refreshing state... [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=go-simple-server-ecs-20230527002928232600000001]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-06780cdb2f9d2ac42]
aws_security_group.alb: Refreshing state... [id=sg-06b0acbe1b5245215]
aws_security_group.ecs: Refreshing state... [id=sg-01817104820a1c119]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07b8049beb4cc0f4d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01847c06253f6a5a3]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:targetgroup/go-simple-server-target-group/35418404c280c12f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f444d3d84593377a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-02fded69eeafebfbb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-038a3874d394ce238]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0094caf37924ecc1c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0643033702df490c6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0708ee74755483bb1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d1f14784708f5dea]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c9321dd4a0f03441]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1996458343]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0708ee74755483bb11080289494]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-008b3aa7a98eb2dd6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0df4a6dc79f929b2b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-034e98de56a761ff0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0775f5db85f86ab62]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d77837d9b95e446b]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c26045e1e6dc22eb]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:loadbalancer/app/go-simple-server-alb/3d1a1e622fe088c7]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0643033702df490c61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0094caf37924ecc1c1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:972365086582:listener-rule/app/go-simple-server-alb/3d1a1e622fe088c7/1659c1a11e41ec4b/cd52e7adf398fad6]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server"
        name                               = "go-simple-server"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:972365086582:task-definition/go-simple-server:3" -> "arn:aws:ecs:ap-northeast-1:972365086582:task-definition/go-simple-server:1"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.record will be created
  + resource "aws_route53_record" "record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "d-wiki.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = "go-simple-server-alb-88156255.ap-northeast-1.elb.amazonaws.com"
          + zone_id                = "Z14GRHDCWA56QT"
        }
    }

  # aws_route53_zone.d-wiki_zone will be created
  + resource "aws_route53_zone" "d-wiki_zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "d-wiki.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
aws_route53_zone.d-wiki_zone: Creating...
aws_ecs_service.ecs_service: Modifying... [id=arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server]
aws_ecs_service.ecs_service: Modifications complete after 1s [id=arn:aws:ecs:ap-northeast-1:972365086582:service/go-simple-server/go-simple-server]
aws_route53_zone.d-wiki_zone: Still creating... [10s elapsed]
aws_route53_zone.d-wiki_zone: Still creating... [20s elapsed]
aws_route53_zone.d-wiki_zone: Still creating... [30s elapsed]
aws_route53_zone.d-wiki_zone: Still creating... [40s elapsed]
aws_route53_zone.d-wiki_zone: Creation complete after 45s [id=Z080441839FKQW0XEUU54]
aws_route53_record.record: Creating...
aws_route53_record.record: Still creating... [10s elapsed]
aws_route53_record.record: Still creating... [20s elapsed]
aws_route53_record.record: Still creating... [30s elapsed]
aws_route53_record.record: Still creating... [40s elapsed]
aws_route53_record.record: Creation complete after 40s [id=Z080441839FKQW0XEUU54_d-wiki.com_A]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":17,"Program":"tfcmt","SHA1":"00d858f67652983d2312d4395f00ea2a365d5cda","Vars":{},"WorkflowName":"Terraform"} -->